onec-mid-base-11/src/Documents/ЗаказПокупателя/ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПокупателя</name>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ЗадолженностьПокупателей</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>СогласованнаяСкидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

onec-mid-base-11/src/CommonModules/ДоработкиФорм/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ДополнитьФорму(Форма) Экспорт
	
	ИмяФормы = Форма.ИмяФормы;
	
// ДИМИТРУК Н. КОНТАКТНОЕ ЛИЦО - для всех документов
	Если СтрНачинаетсяС(ИмяФормы, "Документ.") И СтрЗаканчиваетсяНа(ИмяФормы, ".Форма.ФормаДокумента") Тогда
		ДобавитьКонтактноеЛицо(Форма);
	КонецЕсли;
// ДИМИТРУК Н. Конец. КОНТАКТНОЕ ЛИЦО - для всех документов
	
// ДИМИТРУК Н. СОГЛАСОВАННАЯ СКИДКА И КНОПКА - только для заказа покупателя
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьСогласованнуюСкидку(Форма);
	КонецЕсли;
// ДИМИТРУК Н. Конец. СОГЛАСОВАННАЯ СКИДКА И КНОПКА - для всех документов
	
КонецПроцедуры

#КонецОбласти
	
#Область СлужебныйПрограммныйИнтерфейс 
 
Процедура ДобавитьКонтактноеЛицо(Форма)
	// ДИМИТРУК Н. КОНТАКТНОЕ ЛИЦО - для всех документов
	Если Форма.Элементы.Найти("КонтактноеЛицо") = Неопределено Тогда
		ПолеДоговор = Форма.Элементы.Договор; 
		Родитель = ПолеДоговор.Родитель;
		
		ПолеКонтактноеЛицо = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"), Родитель);
		ПолеКонтактноеЛицо.Вид = ВидПоляФормы.ПолеВвода;
		ПолеКонтактноеЛицо.ПутьКДанным = "Объект.КонтактноеЛицо";
		ПолеКонтактноеЛицо.Заголовок = "Контактное лицо:";
	КонецЕсли;
	// ДИМИТРУК Н. Конец. КОНТАКТНОЕ ЛИЦО - для всех документов
КонецПроцедуры

Процедура ДобавитьСогласованнуюСкидку(Форма)
	
	// ДИМИТРУК Н. СОГЛАСОВАННАЯ СКИДКА 
	Если Форма.Элементы.Найти("СогласованнаяСкидка") = Неопределено Тогда
		ПолеОрганизация = Форма.Элементы.Организация;
		Родитель = ПолеОрганизация.Родитель;
		
		ПолеСкидка = Форма.Элементы.Вставить("СогласованнаяСкидка", Тип("ПолеФормы"), Родитель);
		ПолеСкидка.Вид = ВидПоляФормы.ПолеВвода;
		ПолеСкидка.ПутьКДанным = "Объект.СогласованнаяСкидка";
		ПолеСкидка.Заголовок = "Согласованная скидка:";
		
		ПолеСкидка.УстановитьДействие("ПриИзменении", "СогласованнаяСкидкаПриИзмененииПосле");
	КонецЕсли;
	// ДИМИТРУК Н. Конец. СОГЛАСОВАННАЯ СКИДКА 
	
КонецПроцедуры

#КонецОбласти
